{
    "dinoFacts": [
        "The Tyrannosaurus rex had teeth up to 12 inches long!",
        "The Velociraptor was actually much smaller than in Jurassic Park—about the size of a turkey.",
        "Triceratops had three horns and could weigh up to 12,000 pounds!",
        "Some dinosaurs, like the Spinosaurus, spent much of their time in water.",
        "The Brachiosaurus was one of the tallest dinosaurs, reaching up to 40 feet high!",
        "The Stegosaurus had a brain the size of a walnut!",
        "Dinosaurs lived during the Mesozoic Era, which lasted about 180 million years!",
        "Fossils of dinosaur eggs show that some species cared for their young.",
        "Pterosaurs are often mistaken for dinosaurs, but they are actually flying reptiles.",
        "The Argentinosaurus was one of the largest dinosaurs, measuring up to 100 feet long!",
        "Fossilized dinosaur poop is called coprolite!",
        "The word 'dinosaur' means 'terrible lizard' in Greek.",
        "Tyrannosaurus rex could bite down with a force of over 12,000 pounds!",
        "Some dinosaurs, like the Therizinosaurus, had claws over three feet long!",
        "The Parasaurolophus had a crest on its head that may have been used to make sounds.",
        "Paleontologists use fossilized footprints to study dinosaur behavior.",
        "Feathers have been found on some dinosaur fossils, proving that birds evolved from dinosaurs.",
        "The Velociraptor had large, curved claws on its hind feet used for hunting.",
        "The Ankylosaurus had a tail club that could crush bones!",
        "The Allosaurus was one of the top predators of the late Jurassic period.",
        "Dinosaurs are classified into two main groups: Saurischia (lizard-hipped) and Ornithischia (bird-hipped).",
        "Many dinosaurs had hollow bones, making them lighter and more agile.",
        "The Oviraptor was first thought to steal eggs, but later studies showed it actually protected nests.",
        "The Iguanodon had thumb spikes that may have been used for defense.",
        "Dinosaur fossils have been found on every continent, including Antarctica.",
        "Some dinosaur species, like the Troodon, were very intelligent for their time.",
        "Many plant-eating dinosaurs had gastroliths—stones in their stomachs—to help digest food.",
        "The Spinosaurus is believed to be the first known dinosaur that could swim!",
        "Paleontologists have found evidence that some dinosaurs lived in herds.",
        "The Compsognathus was one of the smallest dinosaurs, about the size of a chicken.",
        "Some dinosaurs, like the Maiasaura, built nests and took care of their young.",
        "The Stygimoloch had thick skulls and was thought to engage in headbutting contests.",
        "The Megalodon was not a dinosaur, but a giant prehistoric shark.",
        "Fossils of dinosaur skin impressions have been found, showing patterns and scales.",
        "Some dinosaurs, like the Microraptor, had four wings!",
        "The Albertosaurus was a close relative of the T. rex but smaller.",
        "The Hadrosaurus is the official state dinosaur of New Jersey.",
        "Scientists can determine a dinosaur's age by counting growth rings in its bones.",
        "The name 'Stegosaurus' means 'roofed lizard' because of its plated back.",
        "The Diplodocus had a tail that could be whipped like a giant bullwhip!",
        "The Utahraptor was much larger and more dangerous than the Velociraptor from Jurassic Park.",
        "Dinosaurs like the Gallimimus could run up to 30 miles per hour!",
        "Some dinosaurs had hundreds of teeth, constantly being replaced throughout their lives.",
        "The Giganotosaurus was larger than a T. rex and lived in South America.",
        "Fossils of dinosaurs with tumors and injuries show they suffered from diseases too.",
        "The Pachycephalosaurus had a skull up to 10 inches thick!",
        "Some dinosaurs, like the Yutyrannus, had full-body feathers.",
        "The Titanosaur was one of the largest creatures to ever walk the Earth.",
        "Not all dinosaurs were gigantic—some were the size of a house cat.",
        "The first dinosaur fossil was discovered in 1677 but wasn't recognized as a dinosaur until later.",
        "Fossilized dinosaur nests suggest some species lived in colonies.",
        "The Dreadnoughtus was so massive that it could weigh as much as 7 elephants!",
        "The Spinosaurus is believed to have been the first dinosaur to live primarily in the water.",
        "Paleontologists have discovered fossilized dinosaur footprints that were preserved in ancient mud.",
        "The Argentinosaurus was one of the largest dinosaurs to ever walk the Earth, reaching 100 feet long.",
        "Some species of dinosaur had wingspans larger than modern-day aircraft!",
        "Dinosaurs with feathers, like the Archaeopteryx, are considered to be the ancestors of modern birds.",
        "The Archaeopteryx is often cited as the first bird, although it lived alongside many dinosaurs.",
        "The Giganotosaurus was one of the largest meat-eating dinosaurs, rivaling the size of the T. rex.",
        "The Pachycephalosaurus is known for its thick skull, which could be used for headbutting.",
        "The Triceratops had three horns: two long ones above its eyes and a shorter one on its nose.",
        "Dinosaurs like the Iguanodon had herbivorous diets, feeding on plants and vegetation.",
        "Some dinosaurs, like the Microraptor, were capable of gliding short distances.",
        "The Baryonyx is thought to have had a long, crocodile-like snout, which it likely used for fishing.",
        "The Therizinosaurus had the longest claws of any known dinosaur, with each claw measuring over 3 feet long.",
        "The Dilophosaurus had a unique frill around its neck, which may have been used for display purposes.",
        "The Allosaurus was one of the top predators in the Jurassic period, often hunting in packs.",
        "Many dinosaurs, like the Diplodocus, had long necks to help them reach high vegetation.",
        "The Sauroposeidon had an enormous neck, allowing it to feed on trees over 50 feet tall.",
        "The Troodon is believed to have been one of the most intelligent dinosaurs.",
        "The Oviraptor was a small carnivorous dinosaur that may have been an egg thief.",
        "Some dinosaurs, like the Hadrosaurus, were known to migrate in herds for protection and food.",
        "The Dromaeosaurus was a small but fierce dinosaur that hunted in packs, similar to modern wolves.",
        "The Velociraptor is known for its large claws and sharp teeth, which it used to catch prey.",
        "The Spinosaurus's sail-like structure may have been used for thermoregulation or mating displays.",
        "The Sauropods, like the Brachiosaurus, had extremely long tails, which may have helped them balance.",
        "Fossilized remains suggest that some dinosaurs, like the Troodon, may have had excellent night vision.",
        "The Camarasaurus was a plant-eating dinosaur with a long neck and a relatively small head.",
        "The Gorgosaurus was a relative of the T. rex, with sharp teeth and strong jaws for hunting.",
        "The Microraptor had feathers on both its arms and legs, enabling it to glide through the air.",
        "The Stegosaurus had large, flat plates along its back that may have been used for temperature regulation.",
        "Some species of dinosaur, like the Ankylosaurus, had armor-like skin for protection from predators.",
        "The Coelophysis was one of the earliest known dinosaurs, appearing in the late Triassic period.",
        "The Maiasaura was a herbivorous dinosaur that took care of its young in large nests.",
        "Some dinosaurs, like the Plesiosaurus, were marine reptiles, not true dinosaurs.",
        "The Megalosaurus was one of the first dinosaurs to be scientifically named in the 19th century.",
        "The Spinosaurus had adaptations for both land and water, making it a versatile predator.",
        "The Troodon may have been one of the first dinosaurs to develop the ability to walk on two legs.",
        "The Sinosauropteryx was a small theropod dinosaur that was one of the first to be discovered with feathers.",
        "The Brachiosaurus had a long neck and large body, allowing it to feed from the tallest trees.",
        "The Protoceratops was a small herbivorous dinosaur that lived in the Cretaceous period.",
        "The Pteranodon, a flying reptile, had wingspans that could reach up to 33 feet.",
        "The Edmontosaurus was a large, plant-eating dinosaur that lived near the end of the Cretaceous period.",
        "The Apatosaurus was a long-necked dinosaur, closely related to the Brontosaurus.",
        "Some dinosaurs, like the Styracosaurus, had frills and spikes for protection and display.",
        "The Lambeosaurus was a duck-billed dinosaur with a unique crested head.",
        "The Megalosaurus was one of the first theropods to be identified by scientists.",
        "The Nodosaurus was a herbivorous dinosaur that had bony plates and spikes along its back.",
        "The Dryptosaurus was one of the first theropods to be found in North America.",
        "The Maiasaura was an early dinosaur that cared for its young in large colonies.",
        "The Argentinosaurus is considered one of the heaviest animals to ever live on land.",
        "The Giganotosaurus was one of the largest predatory dinosaurs, known for its immense size.",
        "The Micropachycephalosaurus was a small herbivorous dinosaur with a thick skull.",
        "The Carcharodontosaurus had large teeth that were capable of slicing through meat with ease.",
        "The Lambeosaurus's distinctive crest may have been used for vocal communication or display.",
        "The Saltasaurus was a smaller sauropod that was covered in bony armor for protection.",
        "The Goniopholis was a crocodile-like dinosaur that lived in the Cretaceous period.",
        "The Euhelopus was a long-necked dinosaur that lived in what is now China during the late Jurassic period.",
        "The Albertosaurus was a smaller relative of the T. rex, with a more slender body.",
        "The Shunosaurus was a sauropod with a unique club-like tail that may have been used for defense.",
        "The Orodromeus was a small herbivorous dinosaur that lived in the late Cretaceous period.",
        "The Eotrachodon was one of the earliest known duck-billed dinosaurs, appearing in the early Cretaceous.",
        "The Wuerhosaurus was a medium-sized herbivorous dinosaur from the Cretaceous period.",
        "The Schlingeromyia was a tiny dinosaur relative that lived alongside larger dinosaurs during the late Jurassic period.",
        "The Hypsilophodon was a small herbivorous dinosaur that lived in the early Cretaceous period.",
        "The Fukuisaurus was a dinosaur that lived during the late Cretaceous period in Japan.",
        "The Rhabdodon was a plant-eating dinosaur that lived in what is now Europe during the late Cretaceous period.",
        "The Eustreptospondylus was a small, bipedal carnivorous dinosaur from the late Jurassic period.",
        "The Orkney dinosaur was a small, herbivorous dinosaur that lived on the Orkney Islands around 165 million years ago.",
        "The Hypsilophodon had a slender body and long legs, making it an agile runner.",
        "The Raptor-like Velociraptor was smaller and more agile than portrayed in popular media.",
        "The Elasmosaurus was a marine reptile with an extremely long neck, reaching lengths of up to 40 feet.",
        "The Shunosaurus had a short neck and tail, making it a unique sauropod among other long-necked species."
    ]
}
